In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('gb.csv')
df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1849-01-01,26.704,1.435,Abidjan,Côte D'Ivoire,5.63N,3.23W
1,1849-02-01,27.434,1.362,Abidjan,Côte D'Ivoire,5.63N,3.23W
2,1849-03-01,28.101,1.612,Abidjan,Côte D'Ivoire,5.63N,3.23W
3,1849-04-01,26.140,1.387,Abidjan,Côte D'Ivoire,5.63N,3.23W
4,1849-05-01,25.427,1.200,Abidjan,Côte D'Ivoire,5.63N,3.23W

In [3]:
df.shape

(239177, 7)

In [4]:
# Not needed to be followed for the assignment as here we are doing just the demo so we are using less data
df = df[:5000]

## Stage-1

In [5]:
df['dt'] = pd.to_datetime(df['dt']).dt.to_period('m')

In [6]:
df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1849-01,26.704,1.435,Abidjan,Côte D'Ivoire,5.63N,3.23W
1,1849-02,27.434,1.362,Abidjan,Côte D'Ivoire,5.63N,3.23W
2,1849-03,28.101,1.612,Abidjan,Côte D'Ivoire,5.63N,3.23W
3,1849-04,26.140,1.387,Abidjan,Côte D'Ivoire,5.63N,3.23W
4,1849-05,25.427,1.200,Abidjan,Côte D'Ivoire,5.63N,3.23W

**Assume city is market-segment column**

- index = Order_date
- Columns = Market_Segment
- Values = Profit
- Aagfunc = sum

In [8]:
dfag = df.pivot_table(index = 'dt', columns = 'City', values = 'AverageTemperature', aggfunc = 'sum')
dfag.head()

City     Abidjan  Addis Abeba  Ahmadabad
dt
1796-01      NaN          NaN     19.649
1796-02      NaN          NaN     21.632
1796-03      NaN          NaN     24.953
1796-04      NaN          NaN     30.297
1796-05      NaN          NaN     33.223

In [9]:
# Assignment:
#train_len = 42
#test = 6

train_len =4500
train_df = dfag[0:train_len]
test_df = dfag[train_len:]

In [10]:
train_df.head()

City     Abidjan  Addis Abeba  Ahmadabad
dt
1796-01      NaN          NaN     19.649
1796-02      NaN          NaN     21.632
1796-03      NaN          NaN     24.953
1796-04      NaN          NaN     30.297
1796-05      NaN          NaN     33.223

**COV Calculation**

In [11]:
cov = pd.DataFrame(columns = ['segment', 'cov'])

In [12]:
cov.head()

Empty DataFrame
Columns: [segment, cov]
Index: []

In [13]:
for i in train_df.columns:
    temp = {'segment':i, 'cov': np.std(train_df[i])/np.mean(train_df[i])}
    cov = cov.append(temp, ignore_index = True)

In [14]:
cov.head()

       segment       cov
0      Abidjan  0.340220
1  Addis Abeba  0.419570
2    Ahmadabad  0.462839

In [15]:
cov.sort_values(by = 'cov')

       segment       cov
0      Abidjan  0.340220
1  Addis Abeba  0.419570
2    Ahmadabad  0.462839

## Stage-2

In [16]:
df_filter = df[df['City'] == 'Abidjan' ]

In [17]:
df_filter.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1849-01,26.704,1.435,Abidjan,Côte D'Ivoire,5.63N,3.23W
1,1849-02,27.434,1.362,Abidjan,Côte D'Ivoire,5.63N,3.23W
2,1849-03,28.101,1.612,Abidjan,Côte D'Ivoire,5.63N,3.23W
3,1849-04,26.140,1.387,Abidjan,Côte D'Ivoire,5.63N,3.23W
4,1849-05,25.427,1.200,Abidjan,Côte D'Ivoire,5.63N,3.23W

In [18]:
df_filter = df_filter[['dt', 'AverageTemperature']]
df_filter.head()

        dt  AverageTemperature
0  1849-01              26.704
1  1849-02              27.434
2  1849-03              28.101
3  1849-04              26.140
4  1849-05              25.427

In [19]:
# Aggregate
df2 = df_filter.groupby('dt').sum()
df2.head()

         AverageTemperature
dt
1849-01              26.704
1849-02              27.434
1849-03              28.101
1849-04              26.140
1849-05              25.427

In [20]:
df2 = df2.to_timestamp()

In [21]:
df2.head()

            AverageTemperature
dt
1849-01-01              26.704
1849-02-01              27.434
1849-03-01              28.101
1849-04-01              26.140
1849-05-01              25.427

In [22]:
train_len = 4500#42
train = df2[0:train_len]
test = df2[train_len:]

In [23]:
train.head()

            AverageTemperature
dt
1849-01-01              26.704
1849-02-01              27.434
1849-03-01              28.101
1849-04-01              26.140
1849-05-01              25.427